VERSION = "version=0.0.2 date=09.11.23"
API_NOT_AVAILABLE = "К сожалению в данный момент я отдыхаю и не могу отвечать на ваши вопросы."

WAITING_FOR_RESPONSE = "Думаю над ответом 🤔 ...."

MAX_TEXT_LENGTH = 2048

HELP_MESSAGE = f"""Привет! Это цифровой двойник Забика {VERSION}
Иногда я начинаю отвечать херню, чтобы сбросить мою память напишите /clear
Иногда ответы занимают много времении, никуда не торопимся
Пока я не напишу ответ, но стоит задавать следующий вопрос

На каждый ваш вопрос я буду возвращаться 3 варианта ответа, вы должны выбраться наилучший с вашей точки зрения. Если
все ответы будут говно, можно нажать на какашку и затем выбрать тот ответ который вам не нравится и сделать зажать
это сообщение. Затем выбрать ответить или replay, и затем написать более подходящий по вашему мнению ответ.

Например что можно спросить:
* Напиши свое ФИО
* Какой у тебя размер ноги
* Где ты работраешь?
* Как библиотеки python ты используешь на работе
* В каких университетах ты учился?
* Как зовут твою девушку?
* Когда началась вторая мировая война
* Скажи свой мобильный номер
* Найди производную от функции log(x)
* Кто такой Ваня Плосков

За достоверность ответов данного бота никто не несет ответственности
"""

STALIN_TEXT_1 = """
Иосиф Виссарионович Сталин (1878-1953) был советским политическим и военным деятелем, лидером Коммунистической партии Советского Союза и первым председателем Совета Министров СССР. Он возглавлял Советский Союз во время Второй мировой войны и после ее окончания, и считается одним из самых влиятельных политических деятелей XX века.
"""

STALIN_TEXT_2 = """
Иосиф Виссарионович Сталин (1878-1953) был советским политическим лидером, генеральным секретарем Центрального Комитета Коммунистической партии Советского Союза (позднее Российской Федерации) с 1922 по 1952 год. Он также был Председателем Совета Народных Комиссаров (позднее Председателем Совета Министров) СССР с 1941 по 1953 год.

Сталин был одним из ключевых фигур в советской истории и играл важную роль в событиях, произошедших в России и Советском Союзе в первой половине 20-го века. Его правление характеризовалось политическим террором, коллективизацией сельского хозяйства, индустриализацией, массовыми репрессиями, и привело к миллионам жертв.

Сталин также был одним из главных командиров СССР во время Второй мировой войны, и его руководство советской армией имело важное значение в победе над нацистской Германией. Его правление завершилось его смертью в 1953 году, после чего в СССР начался процесс десталинизации, который заключался в отказе от многих его политических методов и репрессий.
"""

BREZNEV_TEXT_1 = """
Леонид Ильич Брежнев (1906-1982) был советским политическим лидером и генеральным секретарем Центрального Комитета Коммунистической партии Советского Союза (позднее Российской Федерации) с 1964 по 1982 год. Он также занимал должность Председателя Президиума Верховного Совета СССР (главы государства) с 1977 по 1982 год.

Под руководством Брежнева в СССР была проведена период, который иногда называется "эпохой застоя" или "брежневской стагнацией". В этот период в Советском Союзе была заметна замедленная экономическая активность и ограниченные политические реформы. Внешне, брежневская эпоха также характеризовалась соблюдением холодной войны и поддержанием военного присутствия в Восточной Европе.

Брежнев также известен своей ролью в подписании ряда важных международных соглашений, включая Содружество Независимых Государств (СНГ) и СОЛЖЕР, что означает Соглашение о Ликвидации Ракет Краткого и Среднего Действия. Его правление завершилось его смертью в 1982 году, после чего в СССР началась эпоха перестройки и последующий распад Советского Союза.
"""
NUMBERS = ["1️⃣", "2️⃣", "3️⃣", "4️⃣", "5️⃣"]
